'use strict';

//совместная работа

// let a1 = 7 + 2;
// let a2 = 7 - 3;
// let a3 = 2 * 4;
// let a4 = 4 / 2;
// console.log(a1);
// console.log(a2);
// console.log(a3);
// console.log(a4);

// let height = 23;
// let width = 10;
// let s = height * width;
// console.log(s);
// console.log(`S = ${s}`);

// let str = 'qwerty';
// console.log(str[0]);
// console.log(str[1]);
// console.log(str[3]);

// let sec = 60;
// let min = 60;
// let hour = min * sec;
// console.log(hour);

// let num = 1;
// num += 12;
// num -= 14;
// num *= 5;
// num /= 7;
// num++;
// num--;
// console.log(num);

//Домашняя работа

// Пример №1
// Создайте переменные b1, b2, b3, b4, b5. Поместите в них результат выражений:
// 5 % 3,
// 3 % 5,
// 5 + '3',
// '5' - 3,
// 75 + 'кг'
// Результаты переменных вывести в console.log();
// let b1 = 5 % 3; //2
// let b2 = 3 % 5; //3
// let b3 = 5 + '3'; //53
// let b4 = '5' - 3; //2
// let b5 = 75 + 'кг'; //75кг
// console.log(b1);
// console.log(b2);
// console.log(b3);
// console.log(b4);
// console.log(b5);

// // Пример №2 
// // Напиши скрипт, который находит объем цилиндра высотой 10м (переменная heightC) и 
// // диаметром основания 4м (dC), результат поместите в переменную v.
// let heightC = 10;
// let dC = 4;
// let v = 3.14 * ((dC * dC) / 4) * heightC;
// console.log(v);

// let heightC = 10;
// let dC = 4;
// let v = (heightC * 3.14 * (4 * 4)) / 4;
// console.log(v); //125.6

// // Пример №3
// // Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
// let a = 10;
// let b = 2;
// console.log(a + b); //12
// console.log(a - b); //8
// console.log(a * b); //20
// console.log(a / b); //5

// Пример №4
// //  Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. 
// //  Выведите на экран значение переменной result.
// let c = 15;
// let d = 2;
// let result = c + d;
// console.log(result); //17

// // Пример №5
// //  Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.
// let a5 = 10;
// let bp5 = 2;
// let c5 = 2;
// console.log(a5 + bp5 + c5); //14

// // Пример №6
// //  Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. 
// //  Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат 
// //  запишите в переменную result. Выведите на экран значение переменной result.
// let a6 = 17;
// let b6 = 10;
// let c6 = a6 - b6;
// let d6 = 7;
// let result6 = c6 + d6;
// console.log(result6); //14

// // Пример №7
// // Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, (Имя)!'.
// let name = 'Дима';
// console.log('Привет,' + ' ' + name + '!');

// // Пример №8
// // Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне (Возраст) лет!'.
// let age = 36;
// console.log('Мне' + ' ' + age + ' ' + 'лет' + '!');

// // Пример №9
// // Создайте переменную str и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки выведите 
// // на экран символ 'a', символ 'c', символ 'e'.
// let str9 = 'abcde';
// console.log(str9[0]);
// console.log(str9[2]);
// console.log(str9[4]);

// //Пример №10
// // Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.
// console.log(60 * 60); //3600
// console.log(3600 * 24); //86400
// console.log(86400 * 30); //2592000

// //Пример №11
// //Переделайте этот код так, чтобы в нем использовались операции +=, -=, *=, /=. 
// // Количество строк кода при этом не должно измениться.
// let num11 = 47;
// // num11 += 7; //54
// // num11 -= 18; //29
// // num11 *= 10; //470
// num11 /= 15; //3.13
// console.log(num11);

// // Пример №12
// // Переделайте этот код так, чтобы в нем использовались операции ++ и --. 
// // Количество строк кода при этом не должно измениться.
// let num12 = 10;
// num12++; //11
// num12++; //12
// num12--; //11
// console.log(num12);


