'use strict'
// Совместная работа

// Условие
// Пример 1
// Если переменная num = 5, то выведите 'true' в console.log, иначе выведите 
//'false'.
// let num10 = 5;
// if (num10 === 5) {
// 	console.log(true);
// } else {
// 	console.log(false);
// }

// Пример 2
// У вас есть дом. В доме 3 подъезда, в каждом подъезде по 10 квартир.
// 1 подъезд = 1 - 10;
// 2 подъезд = 11 - 20;
// 3 подъезд = 21 - 30;
// При введении номера квартиры в консоль должно выводиться номер подъезда
// Если вводить не существующую квартиру должно выводиться 'нет такой квартиры'

// let num10 = 33;
// if (num10 > 0 && num10 <= 10) {
// 	console.log('подъезд 1');
// } else if (num10 >= 11 && num10 <= 20) {
// 	console.log('подъезд 2');
// } else if (num10 >= 21 && num10 <= 30) {
// 	console.log('подъезд 3');
// }else {
// 	console.log('нет такой квартиры');
// }

// Циклы
// Пример 3
// Выведите столбец чисел от 1 до 10.
// let y = 1;
// while (y <= 10) {
// 	console.log(y);
// 	y++;
// }

// Пример 4
// Дан массив с элементами [1,2,3]. C помощью цикла for выведите все 
// эти элементы.
// let arr = [1,2,3];
// for (let i = 0; i < arr.length; i++) {
// 	console.log(arr[i]);
// }

// Пример 5
// Дан массив с элементами [2,3,4,5]. С помощью цикла for найдите произведение
// элементов этого массива.
// let result10 = 1;
// let arr = [2,3,4,5];
// for (let i = 0; i < arr.length; i++) {
// 	result10 = result10 * arr[i];
// 	// 1*2 = 2
// 	//2*3 = 6
// 	//6 * 4 = 24
// 	//24 * 5 = 120
// }
// console.log(result10);

// Домашняя работа

// Условия
// Пример 1
// В переменной minute лежит число от 0 до 59. 
// Определите в какую четверть часа попадает это число 
// (в первую, вторую, третью или четвертую).
// let minute = 59;
// if (minute >= 0 && minute <= 20) {
// 	console.log('Первая четверть часа');
// }else if (minute >= 21 && minute <= 40) {
// 	console.log('Вторая четверть часа');
// }else if (minute >= 41 && minute <= 59) {
// 	console.log('Третья четверть часа');
// }else {
// 	console.log('ввели неправильное число');
// }

// Пример 2
// Переменная lang может принимать 2 значения: 'ru' 'en'. 
// Если она имеет значение 'ru', то в переменную arr 
// запишем массив дней недели на русском языке, 
// а если имеет значение 'en' – то на английском. 
// let lang = 'en';
// let arr;
// if (lang == 'ru') {
// 	arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
// }else if (lang == 'en') {
// 	arr = ['mn', 'ts', 'wd', 'th', 'fr', 'st', 'sn'];
// }
// console.log(arr);

// Пример 3 
// Напишите код, который предлагает пользователю ввести целое 
// число. Нужно вывести на экран сколько в этом числе цифр, 
// а также положительное оно или отрицательное. Например, 
// "Число " + num + " однозначное положительное". 
// Достаточно будет определить, является ли число однозначным, 
// двузначным или трехзначным и более.
// let num = 0;
// if (num > 0 && num <= 9) {
// 	console.log('однозначное положительное');
// 	}else if (num < 0 && num >= -9) {
// 		console.log('однозначное отрицательное');
// }else if (num >= 10 && num <= 99) {
// 	console.log('двузначное положительное');
// 	}else if (num <= -10 && num >= -99) {
// 		console.log('двузначное отрицательное');
// }else if (num >=100 && num <= 999) {
// 	console.log('трёхзначное положительное');
// 	}else if (num <=-100 && num >= -999) {
// 		console.log('трёхзначное отрицательное');
// }else if (num >= 1000) {
// 	console.log('четырёхзначное и более положительное');
// 	}else if (num <= -1000) {
// 		console.log('четырёхзначное и более отрицательное');
// }else {
// 	console.log('однозначно ноль');
// }

// Пример 4
// Создаются переменные red и yellow для красного и 
// жёлтого сигналов светофора соответственно.
// В том случае, если переменным red или yellow присвоены 
// значения "нет", горит зелёный сигнал светофора и 
// выводиться сообщение, разрешающее переходить дорогу.
// let red = 'да';
// let yellow;
// if (red == 'нет') {
// 	console.log('переходите дорогу');
// }else if (yellow == 'нет') {
// 	console.log('переходите дорогу');
// }else {
// 	console.log('Стойте');
// }

// Циклы
// Пример 5
// Выведите столбец чисел от 1 до 12.
// let q = 1;
// while (q <= 12) {
// 	console.log(q);
// 	q++;
// }

// Пример 6
// Выведите столбец чисел от 5 до 13.
// let w = 5;
// while (w <= 13) {
// 	console.log(w);
// 	w++;
// }

// Пример 7
// Выведите столбец четных чисел в промежутке от 0 до 16.
// for (let e = 2; e <= 16; e++) {
// 	if (e % 2 == 0) {
// 		console.log(e);
// 	}
// }

// Пример 8 
// С помощью цикла найдите сумму чисел arr = [2,5,8,3,6]
// let result = 0;
// let arr = [2,5,8,3,6];
// for (let i = 0; i < arr.length; i++) {
// 	result = result + arr[i];
// 	//0+2=2
// 	//2+5=7
// 	//7+8=15
// 	//15+3=18
// 	//18+6=24
// }
// console.log(result);